12/data/attachments/31930bc04a90a052.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_9ce3a6ad-9246-4407-b9d1-aa9353a348ec</nif:username>
            <nif:friendToBeAdded>Isaac_never_Actions_40831_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>